In [1]:
#import numpy and pandas and assign aliases to each
import numpy as np
import pandas as pd

In [2]:
pd.isnull(np.nan)
#nan identifies a missing or null value

True

In [3]:
pd.isnull(None)

True

In [4]:
pd.isna(np.nan)
#isna and isnull are synonyms

True

In [5]:
#Return True if the value in bracket is null. Otherwise, return False.
pd.isna(None)

True

In [6]:
#Return True if the value in brackets is not null. Otherwise, return False.
pd.notnull(np.nan)

False

In [7]:
pd.notnull(None)

False

In [8]:
pd.notnull(2)

True

In [9]:
#Return True against the index of the values that are not null in the series and False against null values. 
pd.notnull(pd.Series([1, np.nan, 15]))

0     True
1    False
2     True
dtype: bool

In [10]:
pd.isnull(pd.Series([1, np.nan, 15]))

0    False
1     True
2    False
dtype: bool

In [11]:
pd.isnull(pd.DataFrame({
    'column A': [2, np.nan, 15],
    'column B': [np.nan,4,5],
    'column C': [np.nan,6,np.nan]
}))

   column A  column B  column C
0     False      True      True
1      True     False     False
2     False     False      True

In [12]:
pd.notnull(pd.DataFrame({
    'column A': [2, np.nan, 15],
    'column B': [np.nan,4,5],
    'column C': [np.nan,6,np.nan]
}))

   column A  column B  column C
0      True     False     False
1     False      True      True
2      True      True     False

In [13]:
#Count the number of null values in the series
pd.Series([1,2,np.nan,]).count()

2

In [14]:
#Find the sum of non null values in the series
pd.Series([1,2,np.nan]).sum()

3.0

In [15]:
#Find the mean of non null values in the series
pd.Series([1,2,np.nan]).mean()

1.5

In [16]:
#Create a new series and assign it to a variable 's'
s = pd.Series([1,2,3,np.nan,np.nan,4])

In [17]:
#Return True against the indices of non null values and False against indices of null values 
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [18]:
#Return the indices and values of non null values in s
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [19]:
pd.isnull(s)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [20]:
#Return all indices and values in the series s.
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [21]:
#Return the indices and values of non null values only in s.
s[pd.isnull(s)]

3   NaN
4   NaN
dtype: float64

In [22]:
#Return True for null values and False for non null values in the series s.
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [23]:
s[s.isnull()]

3   NaN
4   NaN
dtype: float64

In [24]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [25]:
#Return the indices and values of non null values only in s.
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [26]:
#Return the total rows with non null values in the series s.
pd.notnull(s).sum()

4

In [27]:
#Return the sum of non null values in the series s.
s[pd.notnull(s)].sum()

10.0

In [28]:
#Return the indices and values of non null values only in s.
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [29]:
#Drop null values from s and return non null values only
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [30]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [31]:
#Create a data frame 'a'
a = pd.DataFrame({
    'column A': [2, np.nan, 15],
    'column B': [np.nan,4,5],
    'column C': [np.nan,6,np.nan],
    'column D': [1,2,3]
})
a

   column A  column B  column C  column D
0       2.0       NaN       NaN         1
1       NaN       4.0       6.0         2
2      15.0       5.0       NaN         3

In [32]:
a

   column A  column B  column C  column D
0       2.0       NaN       NaN         1
1       NaN       4.0       6.0         2
2      15.0       5.0       NaN         3

In [33]:
#Return the total occurences of null values in each column
a.isnull().sum()

column A    1
column B    1
column C    2
column D    0
dtype: int64

In [34]:
#Return True for all null values and False for non null values in a
a.isnull()

   column A  column B  column C  column D
0     False      True      True     False
1      True     False     False     False
2     False     False      True     False

In [35]:
#Get information (e.g total number of columns and data types) about a.
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   column A  2 non-null      float64
 1   column B  2 non-null      float64
 2   column C  1 non-null      float64
 3   column D  3 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 228.0 bytes

In [36]:
#Get the number of rows and columns in a.
a.shape

(3, 4)

In [37]:
#Assign names to columns in a
a.columns = ["Column A", "Column B", "Column C", "Column D"]

In [38]:
a

   Column A  Column B  Column C  Column D
0       2.0       NaN       NaN         1
1       NaN       4.0       6.0         2
2      15.0       5.0       NaN         3

In [39]:
dict = {
    "column A":[1],
    "column B":[2],
    "column C":[3],
    "column D":[4]
}
a = pd.DataFrame(dict)
a

   column A  column B  column C  column D
0         1         2         3         4

In [40]:
# Add a new row to DataFrame a
new_row = {
    "Column A":1,
    "Column B":2,
    "Column C":3,
    "Column D":4
}
a.tail(3)
a.loc[len(a)] = new_row

In [41]:
#Get the last three rows of a
a.tail(3)

   column A  column B  column C  column D
0       1.0       2.0       3.0       4.0
1       NaN       NaN       NaN       NaN

In [42]:
#Drop all rows with at least one null value
a.dropna()

   column A  column B  column C  column D
0       1.0       2.0       3.0       4.0

In [43]:
#Create a new data frame b
b = pd.DataFrame({
    'Col A': [1,np.nan,2,4],
    'Col B': [np.nan,4,6,8],
    'Col C': [2,7,9,1],
    'Col D': [10,13,14,16],
    'Col E': [17,18,19,10]
}
)

In [44]:
b

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN      2     10     17
1    NaN    4.0      7     13     18
2    2.0    6.0      9     14     19
3    4.0    8.0      1     16     10

In [45]:
b.dropna()

   Col A  Col B  Col C  Col D  Col E
2    2.0    6.0      9     14     19
3    4.0    8.0      1     16     10

In [46]:
b

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN      2     10     17
1    NaN    4.0      7     13     18
2    2.0    6.0      9     14     19
3    4.0    8.0      1     16     10

In [47]:
#Add a new row to data frame b and show that row
new_row = {
    "Col A":1,
    "Col B":2,
    "Col C":3,
    "Col D":4,
    "Col E":5
}
b.loc[len(b)] = new_row
b.tail(1)

   Col A  Col B  Col C  Col D  Col E
4    1.0    2.0      3      4      5

In [48]:
b

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN      2     10     17
1    NaN    4.0      7     13     18
2    2.0    6.0      9     14     19
3    4.0    8.0      1     16     10
4    1.0    2.0      3      4      5

In [49]:
#Add a new row with null values only to data frame b.
new_row = {
    "Col A":np.nan,
    "Col B":np.nan,
    "Col C":np.nan,
    "Col D":np.nan,
    "Col E":np.nan
}
b.loc[len(b)] = new_row

In [50]:
b

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN    2.0   10.0   17.0
1    NaN    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    NaN    NaN    NaN    NaN    NaN

In [51]:
#Only drop the rows where all values are null.
b.dropna(how = 'all')

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN    2.0   10.0   17.0
1    NaN    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0

In [52]:
#Drop all rows that have any null values
b.dropna(how = 'any')

   Col A  Col B  Col C  Col D  Col E
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0

In [53]:
#Keep the rows with at least three non null values.
b.dropna(thresh = 3)

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN    2.0   10.0   17.0
1    NaN    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0

In [54]:
b

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN    2.0   10.0   17.0
1    NaN    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    NaN    NaN    NaN    NaN    NaN

In [55]:
#Keep columns with at least three non null values 
b.dropna(thresh = 3, axis = 'columns')

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN    2.0   10.0   17.0
1    NaN    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    NaN    NaN    NaN    NaN    NaN

In [56]:
#Keep columns with at least five non null values
b.dropna(thresh = 5, axis = 'columns')

   Col C  Col D  Col E
0    2.0   10.0   17.0
1    7.0   13.0   18.0
2    9.0   14.0   19.0
3    1.0   16.0   10.0
4    3.0    4.0    5.0
5    NaN    NaN    NaN

In [57]:
#Fill null values with '00'.
b.fillna(00)

   Col A  Col B  Col C  Col D  Col E
0    1.0    0.0    2.0   10.0   17.0
1    0.0    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    0.0    0.0    0.0    0.0    0.0

In [58]:
#Fill null values with the mean
b.fillna(b.mean())

   Col A  Col B  Col C  Col D  Col E
0    1.0    5.0    2.0   10.0   17.0
1    2.0    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    2.0    5.0    4.4   11.4   13.8

In [59]:
#Forward fill the null values ,i.e, fill the null value with the non null value at the row right above it.
b.fillna(method = 'ffill')

C:\Users\DELL\AppData\Local\Temp\ipykernel_6708\3826356818.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  b.fillna(method = 'ffill')

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN    2.0   10.0   17.0
1    1.0    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    1.0    2.0    3.0    4.0    5.0

In [60]:
#Backward fill the null values ,i.e, fill the null value with the non null value at the row right below it.
b.fillna(method = 'bfill')

C:\Users\DELL\AppData\Local\Temp\ipykernel_6708\930395483.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  b.fillna(method = 'bfill')

   Col A  Col B  Col C  Col D  Col E
0    1.0    4.0    2.0   10.0   17.0
1    2.0    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    NaN    NaN    NaN    NaN    NaN

In [61]:
b

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN    2.0   10.0   17.0
1    NaN    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    NaN    NaN    NaN    NaN    NaN

In [62]:
#Create a series, fill the null value with the non null value right before it it.
pd.Series([np.nan,1,4,6,np.nan,9]).fillna(method = 'ffill')

C:\Users\DELL\AppData\Local\Temp\ipykernel_6708\2966961955.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([np.nan,1,4,6,np.nan,9]).fillna(method = 'ffill')

0    NaN
1    1.0
2    4.0
3    6.0
4    6.0
5    9.0
dtype: float64

In [63]:
b

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN    2.0   10.0   17.0
1    NaN    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    NaN    NaN    NaN    NaN    NaN

In [64]:
a

   column A  column B  column C  column D
0       1.0       2.0       3.0       4.0
1       NaN       NaN       NaN       NaN

In [65]:
#Fill the null values with non null values in the row right above.
a.fillna(method = 'ffill', axis = 0)

C:\Users\DELL\AppData\Local\Temp\ipykernel_6708\2118201727.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  a.fillna(method = 'ffill', axis = 0)

   column A  column B  column C  column D
0       1.0       2.0       3.0       4.0
1       1.0       2.0       3.0       4.0

In [66]:
#Fill the null values with non null values in the preceeding column.
a.fillna(method = 'ffill', axis = 1)

C:\Users\DELL\AppData\Local\Temp\ipykernel_6708\2913205065.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  a.fillna(method = 'ffill', axis = 1)

   column A  column B  column C  column D
0       1.0       2.0       3.0       4.0
1       NaN       NaN       NaN       NaN

In [67]:
b.fillna(method = 'ffill', axis = 0)

C:\Users\DELL\AppData\Local\Temp\ipykernel_6708\1391513687.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  b.fillna(method = 'ffill', axis = 0)

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN    2.0   10.0   17.0
1    1.0    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    1.0    2.0    3.0    4.0    5.0

In [68]:
b.fillna(method = 'ffill', axis = 1)

C:\Users\DELL\AppData\Local\Temp\ipykernel_6708\170165819.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  b.fillna(method = 'ffill', axis = 1)

   Col A  Col B  Col C  Col D  Col E
0    1.0    1.0    2.0   10.0   17.0
1    NaN    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    NaN    NaN    NaN    NaN    NaN

In [69]:
b.ffill(axis = 0)

   Col A  Col B  Col C  Col D  Col E
0    1.0    NaN    2.0   10.0   17.0
1    1.0    4.0    7.0   13.0   18.0
2    2.0    6.0    9.0   14.0   19.0
3    4.0    8.0    1.0   16.0   10.0
4    1.0    2.0    3.0    4.0    5.0
5    1.0    2.0    3.0    4.0    5.0

In [70]:
#Count the number of non null values in each column
b.count()

Col A    4
Col B    4
Col C    5
Col D    5
Col E    5
dtype: int64

In [71]:
#Get the sum of values in each column
b.sum()

Col A     8.0
Col B    20.0
Col C    22.0
Col D    57.0
Col E    69.0
dtype: float64

In [72]:
#Count the number of null values in each column
b.isna().sum()

Col A    2
Col B    2
Col C    1
Col D    1
Col E    1
dtype: int64

In [73]:
b.isna()

   Col A  Col B  Col C  Col D  Col E
0  False   True  False  False  False
1   True  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False
5   True   True   True   True   True

In [74]:
b[b.isna()]

   Col A  Col B  Col C  Col D  Col E
0    NaN    NaN    NaN    NaN    NaN
1    NaN    NaN    NaN    NaN    NaN
2    NaN    NaN    NaN    NaN    NaN
3    NaN    NaN    NaN    NaN    NaN
4    NaN    NaN    NaN    NaN    NaN
5    NaN    NaN    NaN    NaN    NaN

In [75]:
b.notnull()

   Col A  Col B  Col C  Col D  Col E
0   True  False   True   True   True
1  False   True   True   True   True
2   True   True   True   True   True
3   True   True   True   True   True
4   True   True   True   True   True
5  False  False  False  False  False

In [76]:
#Find the number of rows in b.
len(b)

6

In [77]:
#Find the number of rows and columns in b.
b.shape

(6, 5)

In [78]:
#Return True if there is any valid(non null) data in the series.
pd.Series([True,True,False]).any()

True

In [79]:
#Return True if all the data in the series is valid.
pd.Series([True,True,False]).all()

False

In [80]:
pd.Series([True,True,True]).any()

True

In [81]:
pd.Series([True,True,True]).all()

True

In [82]:
pd.Series([False,False,False]).any()

False

In [83]:
pd.Series([True,True,True]).all()

True

In [84]:
c = pd.DataFrame({
    'Sex':['M','F','F','D','?'],
    'Age':[29,38,24,290,25]
}
)
c

  Sex  Age
0   M   29
1   F   38
2   F   24
3   D  290
4   ?   25

In [85]:
#Return unique occurences of values in the column 'Sex' in data frame c.
c['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [86]:
#Count the number of times each value appears in the column 'Sex' in data frame c.
c['Sex'].value_counts()

Sex
F    2
M    1
D    1
?    1
Name: count, dtype: int64

In [87]:
#Replace the value D with F in the 'Sex' column in data frame c.
c['Sex'].replace('D','F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [88]:
c['Sex'].replace({'D':'F','N':'M'})

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [89]:
#Divide the 'Age' column by 10 for ages above 100. (To get rid of invalid values)
c.loc[c['Age'] > 100,'Age'] = c.loc[c['Age'] > 100,'Age'] / 10
c

  Sex  Age
0   M   29
1   F   38
2   F   24
3   D   29
4   ?   25

In [90]:
ambassadors = pd.Series([
    'France', 'United Kingdom', 'United Kingdom', 'Italy', 'Germany', 'Germany', 'Germany'
],
    index = [
    'Grard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth'
    ]
)

In [91]:
ambassadors

Grard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [92]:
#Return True where the value is a duplicate.
#By default, the first occurence is not considered a duplicate.
ambassadors.duplicated()

Grard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [93]:
#Use 'keep = last' if you want the last repeated item to be considered as not the one that is duplicated.
ambassadors.duplicated(keep = 'last')

Grard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [94]:
#Use 'keep = False' if you want every item that has been repeated to be considered a duplicate
ambassadors.duplicated(keep = False)

Grard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [95]:
#Drop duplicate values from ambassadors
ambassadors.drop_duplicates()

Grard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [96]:
ambassadors.drop_duplicates(keep = 'last')

Grard Araud                  France
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [97]:
ambassadors.drop_duplicates(keep = False)

Grard Araud          France
Armando Varricchio     Italy
dtype: object

In [98]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})

In [99]:
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [100]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [101]:
#Find duplicate values in the column 'Name' in the series 'Players'
players.duplicated(subset = ['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [102]:
players.duplicated(subset = ['Name'], keep = 'last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [103]:
players.duplicated(subset = ['Name'], keep = False)

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [104]:
players.drop_duplicates()

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [105]:
players.drop_duplicates(subset = ['Name'])

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF

In [106]:
players.drop_duplicates(subset = ['Name'], keep = 'last')

              Name Pos
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [107]:
players.drop_duplicates(subset = ['Name'], keep = False)

              Name Pos
1     LeBron James  SF
3  Carmelo Anthony  SF

In [108]:
f = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
]})

In [109]:
f

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [110]:
#Split the values in f by an underscore
f['Data'].str.split('_')

0       [1987, M, US , 1]
1       [1990?, M, UK, 1]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4      [1985, F, I  T, 2]
Name: Data, dtype: object

In [111]:
#Create a data frame from f
f['Data'].str.split('_', expand = True)

       0  1      2  3
0   1987  M    US   1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

In [112]:
f = f['Data'].str.split('_', expand = True)

In [113]:
f

       0  1      2  3
0   1987  M    US   1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

In [114]:
#Assign names to the columns in f
f.columns = ['Year','Sex','Country','No Children']
f

    Year Sex Country No Children
0   1987   M     US            1
1  1990?   M      UK           1
2   1992   F      US           2
3  1970?   M      IT           1
4   1985   F    I  T           2

In [115]:
#Return True where the column 'Year' in f contains a question mark. Otherwise return False.
f['Year'].str.contains('\?')

0    False
1     True
2    False
3     True
4    False
Name: Year, dtype: bool

In [116]:
f['Country'].str.contains("U")

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool